### 📖 Terraform Plan (infra/resources/dev) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_dns_ns_record.integration_dx_pagopa_it will be created
  + resource "azurerm_dns_ns_record" "integration_dx_pagopa_it" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + records             = (known after apply)
      + resource_group_name = "dx-d-itn-network-rg-01"
      + tags                = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        }
      + ttl                 = 172800
      + zone_name           = "dev.dx.pagopa.it"
    }

  # azurerm_dns_zone.integration_dx_pagopa_it will be created
  + resource "azurerm_dns_zone" "integration_dx_pagopa_it" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "integration.dx.pagopa.it"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "dx-d-itn-network-rg-01"
      + tags                      = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        }

      + soa_record (known after apply)
    }

  # module.mcp_server.aws_api_gateway_deployment.mcp_server must be replaced
+/- resource "aws_api_gateway_deployment" "mcp_server" {
      ~ created_date = "2026-01-21T09:32:06Z" -> (known after apply)
      ~ id           = "4nauqg" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "c6b5410d91a95775ff361c9de584f59475482a7b"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.mcp_server.aws_api_gateway_integration.bedrock_search will be created
  + resource "aws_api_gateway_integration" "bedrock_search" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "eu-central-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "awadwtf245"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:366865817117:function:dx-d-euc1-mcp-server-lambda-01/invocations"
    }

  # module.mcp_server.aws_api_gateway_method.search will be created
  + resource "aws_api_gateway_method" "search" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "eu-central-1"
      + request_parameters = {
          + "method.request.header.Content-Type" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "awadwtf245"
    }

  # module.mcp_server.aws_api_gateway_resource.search will be created
  + resource "aws_api_gateway_resource" "search" {
      + id          = (known after apply)
      + parent_id   = "3gckmfp48f"
      + path        = (known after apply)
      + path_part   = "search"
      + region      = "eu-central-1"
      + rest_api_id = "awadwtf245"
    }

  # module.mcp_server.aws_api_gateway_stage.prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod" {
      ~ deployment_id         = "4nauqg" -> (known after apply)
        id                    = "ags-awadwtf245-prod"
        tags                  = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/dev"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.testing.azurerm_subnet_network_security_group_association.common_runner_to_tests_pep["/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-be-func-snet-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "common_runner_to_tests_pep" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-common-vnet-nsg-01"
      + subnet_id                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-be-func-snet-01"
    }

  # module.testing.azurerm_subnet_network_security_group_association.common_runner_to_tests_pep["/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-fe-app-snet-01"] will be created
  + resource "azurerm_subnet_network_security_group_association" "common_runner_to_tests_pep" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/networkSecurityGroups/dx-d-itn-common-vnet-nsg-01"
      + subnet_id                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-fe-app-snet-01"
    }

  # module.testing.azurerm_virtual_network_peering.common_to_tests["e2e"] must be replaced
-/+ resource "azurerm_virtual_network_peering" "common_to_tests" {
      ~ allow_gateway_transit                  = true -> false
      ~ id                                     = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/virtualNetworkPeerings/dx-d-itn-common-vnet-01-to-dx-d-itn-e2e-vnet-01" -> (known after apply)
      ~ local_subnet_names                     = [
          + "dx-d-itn-github-runner-snet-01",
        ]
        name                                   = "dx-d-itn-common-vnet-01-to-dx-d-itn-e2e-vnet-01"
      - only_ipv6_peering_enabled              = false -> null
      ~ peer_complete_virtual_networks_enabled = true -> false # forces replacement
      ~ remote_subnet_names                    = [
          + "dx-d-itn-pep-snet-01",
        ]
        # (7 unchanged attributes hidden)
    }

  # module.testing.azurerm_virtual_network_peering.tests_to_common["e2e"] must be replaced
-/+ resource "azurerm_virtual_network_peering" "tests_to_common" {
      ~ allow_forwarded_traffic                = true -> false
      ~ id                                     = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-e2e-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-e2e-vnet-01/virtualNetworkPeerings/dx-d-itn-e2e-vnet-01-to-dx-d-itn-common-vnet-01" -> (known after apply)
      ~ local_subnet_names                     = [
          + "dx-d-itn-pep-snet-01",
        ]
        name                                   = "dx-d-itn-e2e-vnet-01-to-dx-d-itn-common-vnet-01"
      - only_ipv6_peering_enabled              = false -> null
      ~ peer_complete_virtual_networks_enabled = true -> false # forces replacement
      ~ remote_subnet_names                    = [
          + "dx-d-itn-github-runner-snet-01",
        ]
      ~ use_remote_gateways                    = true -> false
        # (6 unchanged attributes hidden)
    }

Plan: 10 to add, 1 to change, 3 to destroy.

Warning: Reference to undefined provider

  on aws.tf line 12, in module "mcp_server":
  12:     aws.us_east_1 = aws.us-east-1

There is no explicit declaration for local provider name "aws.us_east_1" in
module.mcp_server, so Terraform is assuming you mean to pass a configuration
for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws.us_east_1" with the source address "hashicorp/aws".
```

</details>
